app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("address", "apt", "city", "created_at", "dealerCont", "email", "firstName", "interest_Kicks", "interest_LEAF", "interest_Rogue", "interest_RogueSport", "lastName", "minor", "news", "opinion", "partcipate", "possPurch", "purchTime", "sign", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)